In [28]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [29]:
gdp_df = pd.read_csv("../data/UNdata_Export_20210915_042801961.csv")

In [30]:
gdp_df.head(10)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN
5     Afghanistan  2014  2102.385234              NaN
6     Afghanistan  2013  2116.465454              NaN
7     Afghanistan  2012  2075.491747              NaN
8     Afghanistan  2011  1904.559799              NaN
9     Afghanistan  2010  1957.029338              NaN

In [31]:
gdp_df.tail(5)

,Country or Area,Year,Value,Value Footnotes
6865,Zimbabwe,1992,3054.889178,NaN
6866,Zimbabwe,1991,3426.598094,NaN
6867,Zimbabwe,1990,3324.348171,NaN
6868,footnoteSeqID,Footnote,NaN,NaN
6869,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [32]:
gdp_df = pd.read_csv("../data/UNdata_Export_20210915_042801961.csv", skipfooter=2, engine='python')

In [33]:
gdp_df.tail(5)

     Country or Area  Year        Value  Value Footnotes
6863        Zimbabwe  1994  3263.934978              NaN
6864        Zimbabwe  1993  3033.504852              NaN
6865        Zimbabwe  1992  3054.889178              NaN
6866        Zimbabwe  1991  3426.598094              NaN
6867        Zimbabwe  1990  3324.348171              NaN

In [35]:
gdp_df = gdp_df.drop(["Value Footnotes"], axis=1)

In [38]:
gdp_df = gdp_df.rename({"Country or Area": "Country", "Value": "GDP_Per_Capita"}, axis="columns")

In [39]:
print("gdp_df shape: ", gdp_df.shape)
print(gdp_df.dtypes)

gdp_df shape:  (6868, 3)
Country            object
Year                int64
GDP_Per_Capita    float64
dtype: object

In [55]:
gdp_df['Year'] = pd.to_datetime(gdp_df['Year'], format='%Y')

In [56]:
gdp_df.dtypes

Country                   object
Year              datetime64[ns]
GDP_Per_Capita           float64
dtype: object

In [57]:
gdp_df.head()

       Country       Year  GDP_Per_Capita
0  Afghanistan 2019-01-01     2065.036398
1  Afghanistan 2018-01-01     2033.779002
2  Afghanistan 2017-01-01     2058.383832
3  Afghanistan 2016-01-01     2057.062164
4  Afghanistan 2015-01-01     2068.265904

In [59]:
gdp_df['Year'].value_counts() 
# Number of countries increases over the years.

2017-01-01    238
2016-01-01    238
2015-01-01    238
2014-01-01    238
2013-01-01    238
2012-01-01    237
2011-01-01    237
2018-01-01    237
2010-01-01    236
2009-01-01    236
2008-01-01    235
2007-01-01    235
2006-01-01    235
2005-01-01    234
2004-01-01    234
2003-01-01    233
2002-01-01    233
2001-01-01    232
2000-01-01    231
2019-01-01    231
1999-01-01    224
1998-01-01    223
1997-01-01    223
1996-01-01    221
1995-01-01    221
1994-01-01    214
1993-01-01    212
1992-01-01    209
1991-01-01    208
1990-01-01    207
Name: Year, dtype: int64

In [75]:
tmp_merge = pd.merge(gdp_df[gdp_df['Year'] == '1990-01-01'], gdp_df[gdp_df['Year'] == '2017-01-01'], on='Country', how='right')

In [76]:
tmp_merge

,Country,Year_x,GDP_Per_Capita_x,Year_y,GDP_Per_Capita_y
0,Afghanistan,NaT,NaN,2017-01-01,2058.383832
1,Albania,1990-01-01,4842.734635,2017-01-01,12811.759436
2,Algeria,1990-01-01,8746.352901,2017-01-01,11737.409353
3,Angola,1990-01-01,5783.429064,2017-01-01,7310.901738
4,Antigua and Barbuda,1990-01-01,15459.551675,2017-01-01,19840.076123
...,...,...,...,...,...
233,Vietnam,1990-01-01,1673.249634,2017-01-01,7155.745829
234,West Bank and Gaza,NaT,NaN,2017-01-01,6401.740891
235,World,1990-01-01,9680.269697,2017-01-01,16253.385518
236,Zambia,1990-01-01,2190.182814,2017-01-01,3485.005238
237,Zimbabwe,1990-01-01,3324.348171,2017-01-01,3028.245976

In [81]:
tmp_merge[tmp_merge.GDP_Per_Capita_x.isnull()]['Country']

0                    Afghanistan
22        Bosnia and Herzegovina
31                      Cambodia
35                Cayman Islands
45                       Croatia
46                      CuraÃ§ao
51                      Djibouti
62                       Estonia
88                       Hungary
109                       Kosovo
110                       Kuwait
117                       Latvia
121                      Liberia
122                        Libya
123                    Lithuania
132                     Maldives
144                      Moldova
146                   Montenegro
151                        Nauru
163           Other small states
166                        Palau
177                        Qatar
181      SÃ£o TomÃ© and Principe
183                   San Marino
186                       Serbia
190    Sint Maarten (Dutch part)
191              Slovak Republic
193                 Small states
215                  Timor-Leste
222     Turks and Caicos Islands
234           West Bank and Gaza
Name: Country, dtype: object